# Вычислить число Пи c заданной точностью d
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

# !!ВНИМАНИЕ

# !!! не использовать константу math.pi



d = input('Введите точность измерения, от 0.1 до 0.0000000001:  ' )

try:
    float(d)
except:
    print('Введено не корректное число.')
    quit()

d = float(d)
if d>=1:
    print('Введено не корректное число.')
    quit()

count = 0
while d<1:
    d*=10
    count+=1


sum1 = 0
for k in range (count):
    res1 = 1/(16)**k * ((4)/(8*k+1) - (2)/(8*k+4) - (1)/(8*k+5) -(1)/(8*k+6)) 
    sum1 +=res1


import math
print(f'{math.pi} - Эталон, числа Пи.')

print(f'{sum1} - Вычисленное значение, числа Пи.')
sum1 = str(sum1)

print(f'{sum1[:count+2]} - Значение заданной точности, числа Пи.')